tutorials/combustion/XiFoam/les/pitzDaily3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          600;
        startFace       715675;
    }
    outlet
    {
        type            patch;
        nFaces          1140;
        startFace       716275;
    }
    upperWall
    {
        type            wall;
        nFaces          4460;
        startFace       717415;
    }
    lowerWall
    {
        type            wall;
        nFaces          5000;
        startFace       721875;
    }
    front
    {
        type            cyclic;
        nFaces          12225;
        startFace       726875;
        matchTolerance  0.0001;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        nFaces          12225;
        startFace       739100;
        matchTolerance  0.0001;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
